// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   ShCommonStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell common messages
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"

// Note:
// Generic error message formats for shell commands, all shell commands can & should share these formats

#string STR_NO_HELP                        #language eng  "%HVerbose help information is not available in backward compatible mode.%N\n"

#string STR_SHELLENV_GNC_TOO_MANY          #language eng  "%hs: Too many arguments\n"

#string STR_SHELLENV_GNC_TOO_FEW           #language eng  "%hs: Too few arguments\n"

#string STR_SHELLENV_GNC_UNKNOWN_FLAG      #language eng  "%hs: Unknown flag - '%hs'\n"

#string STR_SHELLENV_GNC_DUP_FLAG          #language eng  "%hs: Duplicated flag - '%hs'\n"

#string STR_SHELLENV_GNC_LACK_ARG          #language eng  "%hs: Lack of argument for flag - '%hs'\n"

#string STR_SHELLENV_GNC_FLAG_CONFLICT     #language eng  "%hs: Flags conflict with - '%hs'\n"

#string STR_SHELLENV_GNC_BAD_VALUE_4_FLAG  #language eng  "%hs: Bad value - '%hs' for flag - '%hs'\n"

#string STR_SHELLENV_GNC_OUT_RESOURCE      #language eng  "%hs: Out of resource\n"

#string STR_SHELLENV_GNC_INVALID_ARG       #language eng  "%hs: Invalid argument - '%hs'\n"

#string STR_SHELLENV_GNC_NOT_CUR_DIR       #language eng  "%hs: Current directory not specified\n"

#string STR_SHELLENV_GNC_NO_MAPPED_DEV     #language eng  "%hs: Cannot find mapped device\n"

#string STR_SHELLENV_GNC_NO_MAPPED_DEV_EX  #language eng  "%hs: Cannot find mapped device - %hs\n"

#string STR_SHELLENV_GNC_FILE_NOT_FOUND    #language eng  "%hs: File not found - '%hs'\n"

#string STR_SHELLENV_GNC_CANNOT_OPEN_FILE  #language eng  "%hs: Cannot open file - '%hs'\n"

#string STR_SHELLENV_GNC_READ_FILE_ERR     #language eng  "%hs: Read file error - '%hs'\n"

#string STR_SHELLENV_GNC_WRITE_FILE_ERR    #language eng  "%hs: Write file error - '%hs'\n"

#string STR_SHELLENV_GNC_ACCESS_FILE_ERR   #language eng  "%hs: Access file error - '%hs'\n"

#string STR_SHELLENV_GNC_LOC_PROT_ERR      #language eng  "%hs: Locate protocol error\n"

#string STR_SHELLENV_GNC_LOC_PROT_ERR_EX   #language eng  "%hs: Locate protocol error - '%hs'\n"

#string STR_SHELLENV_GNC_LOC_HANDLE_ERR    #language eng  "%hs: Locate handle error\n"

#string STR_SHELLENV_GNC_LOC_HANDLE_ERR_EX #language eng  "%hs: Locate handle error - '%hs'\n"

#string STR_SHELLENV_GNC_ONLY_SCRIPT       #language eng  "%hs: Only supported in script files\n"

#string STR_SHELLENV_GNC_NO_MULTI_FILE     #language eng  "%hs: '%hs' argument cannot be multiple files\n"

#string STR_SHELLENV_GNC_NO_DIR            #language eng  "%hs: '%hs' argument cannot be a directory\n"

#string STR_SHELLENV_GNC_CANNOT_OPEN_DIR   #language eng  "%hs: Cannot open directory - '%hs'\n"

#string STR_SHELLENV_GNC_PROTOCOL_NOT_FOUND #language eng  "%hs: Protocol - '%hs' not found\n"

#string STR_SHELLENV_GNC_HANDLE_NOT_FOUND #language eng  "%hs: Handle - '%hs' not found\n"

#string STR_SHELLENV_GNC_HANDLE_OUT_OF_RANGE #language eng  "%hs: Handle - '%hs' out of range\n"

#string STR_SHELLENV_GNC_INVALID_HANDLE_NUM #language eng  "%hs: Invalid handle number - '%hs'\n"

#string STR_SHELLENV_GNC_SUCCESS           #language eng  "%hs: Success\n"

#string STR_SHELLENV_GNC_COMMAND_NOT_SUPPORT  #language eng  "%hs: This command is not supported in the underlying EFI version, required EFI version should be %hs or above\n\n"

